# -*- coding: utf-8 -*-
root = ['random_answer', 'Deepwarrior', 'kstera', 'uhi_official', 'alukr', 'Kotokotokotova', 'areatangent', 'Elstaar']
alpha_moder = [265419583, 206787289]

deep_chat = 150029429
citrus_chat = 507917490
uhi_chat = 287819651
cifr_chat = 206787289
zoloto_chat = 311689962
rinneko_chat = 264360251
undo_chat = 332099213
rels_chat = 44989459
misha_chat = 53316498
osa_chat = 299778732

seconds_in_day = 85000

hi_stickers = ['CAADAgADWwQAAm4y2AABD38IAooC_j4C', 'CAADAgADhAEAAjZ2IA7YnALZRRvJMwI']
hi_citrus = ['/DELITAPELSIN', 'ГРЕЙПФРУКТ!', 'ОПРИВЕТ', 'ЦИТРУС!', 'Я ЗНАЮ ЭТУ ДЕВЧОНКУ!', 'ЧТО НОВЕНЬКОГО',
             'СПОЙ ПЕСЕНКУ!', 'НУ МАААААМ!', "КАПИТАН ЛУЧШЕЙ КОМАНДЫ - ДЕВУШКА?", "МОЯ КУРОЧКА :*"]
hi_cifr = ['1', "НАДЕЮСЬ, ЗАВТРА ТЫ ПРО ДЛИННОКОТА НЕ ЗАБУДЕШЬ.", "ПРИВЕТ, ЦИФЕРКА",
           "1 такую цифру знаешь?💁\nНадеюсь да\nВедь ты не кот🐱", "ЧТО-ТО ДЛИННОЕ ЕЩЁ - ЭТО ПРО ДЛИННОКОТА.",
           "ЗНАЕШЬ, СКОЛЬКО БУДЕТ 0 ФАКТОРИАЛ?", "ОПЯТЬ ТЫ С ЭТИМ СВОИМ СТИКЕРОМ"]
approve_phrase = ['МОЛОДЕЦ!', "ЧИТЕР!", 'ЛАДНО, ЗАСЧИТАЮ', 'MOLODETC!', 'МЛДЦ!', 'ЦЕДОЛОМ', "МОЛОДЕЦ)))", "МОЛОЕ",
                  "МОЛОДЕЦ.", "М О Л О Д Е Ц !", "МОЛОДЕЦ-ДЕЦ!", "МЛОДЕУЦ", "МОЛОДЦУНЕСЕЧКА!",
                  "ВЫ ТОЛЬКО ПОСМОТРИТЕ НА ЭТО УТОНЧЕННОЕ ВЫПОЛНЕНИЕ ЗАДАНИЯ, НА ЭТО СТАРАНИЕ И УПОРСТВО! Я СЧИТАЮ," +
                  " ЧТО ТАКОЙ ИГРОК НЕПРЕМЕННО ЗАСЛУЖИВАЕТ МОЛОДЦА."]
fail_phrase = ['ТЫ ДУРА?', 'ПРОИГРАЛ', 'БАЯЗИД.', 'ТЫ МУРА?']
dlinnohead = \
    ['CAADAgADAQAD2VJTDEk_XDdN8vEQAg', 'CAADAgADCAAD2VJTDLigLyUY7D8aAg', 'CAADAgADEwAD2VJTDHU9kKWQCF0wAg',
     'CAADAgADKgAD2VJTDATKb5Sl68OnAg', 'CAADAgADHAAD2VJTDLu-Mx44yFUuAg', 'CAADBAADZQMAAuJy2QABJ1cx-fQb77sC',
     'CAADBAADgQMAAuJy2QABf0C0EPLQO0UC', 'CAADBAADawMAAuJy2QABFA81XvWYIZ8C', 'CAADBAADdQMAAuJy2QABt8J1yVBTIQoC',
     'CAADAgAD3gMAAtQlfAlfLmgHaL2eTgI', 'CAADAgADMAAD2VJTDMSYdTjWjmeuAg']
memory = ["30 ДЕКАБРЯ", "АЗАЗА", "БАЯН", "БУГУЛЬМА", "ДНИЩЕ", "КОМАНДА ТИГРОВ", "КОНЬЯК", "ОПТИЧЕСКАЯ ИНФОРМАТИКА",
          "ПИРАНЬЯ", "ПОЛЁТ", "ПЯТОЧКИ", "РОБИНЗОН", "САМАРАНГ", "СЕКСИЗМ", "ВЕРЕЩАТЕЛЬ", "29 ДЕКАБРЯ",
          "АУТОАСФИКСИОФИЛИЯ",
          "КОРМИЛИЦА", "УНХОНЯШЕЧКА ЛОНГУСЕНЬКАЯ", "СИСЕНИКА", "ДИПОЧЕНЬКО", "КАМНЕПАД, ВСЕ УМЕРЛИ", "МИРТЮЛЯ",
          "СОЛНЦЕСТОЯНИЕ", "ОКСИД", "МАГНИТОГРАММА", "ЛИБИДО", "ПАЛТУС",
          "ТРИЛЛИОН", "АГИТКА", "КОРОЛЬ ЛИР", "ВИНО КОНЧИЛОСЬ(", "ХАРИУС"]
numbers = [
     'CAADAgADHQADsjRGHmICxgflpK-AAg', 'CAADAgADKAADsjRGHteLnmyyI7GCAg', 'CAADAgADIQADsjRGHqrxWWzW0GhKAg',
     'CAADAgADIgADsjRGHrzBiD52otYrAg', 'CAADAgADIAADsjRGHiEXZ5N3guXYAg', 'CAADAgADDAADsjRGHsDfKDJ9i8kaAg',
     'CAADAgADCAADsjRGHmLQ31WmM2KfAg', 'CAADAgADKgADsjRGHq-fx19cPlV5Ag', 'CAADAgADLQADsjRGHqK-Yozf6v5mAg',
     'CAADAgADDwADsjRGHv62n3n405i_Ag']
hermite_gaussian_modes = ['CAADAgADEQADkostA3DN6NzApx5JAg', 'CAADAgADEgADkostA9sHz8S4a413Ag',
                        'CAADAgADEwADkostA2vK1OpNOcPtAg', 'CAADAgADFAADkostA9vY_JeFNyXDAg',
                        'CAADAgADFQADkostAzDcVqz6x2uLAg', 'CAADAgADFgADkostAwePB0bp3pSeAg',
                        'CAADAgADFwADkostA-f4qlzLnrlgAg', 'CAADAgADGAADkostA2DEeFePrPEjAg',
                        'CAADAgADGQADkostA-es84ySG9OSAg', 'CAADAgADGgADkostA7wf1LT8G0OKAg']
# format: message_list, sticker_list, user, reaction_messages_list, reaction_stickers_list, func for executing
# "[[], [], 0, [], [], None],"
reactions = [
    [[], hi_stickers, citrus_chat, hi_citrus, []],
    [[], ['CAADAQADpwADQPhSDLndcqosubnnAg', 'CAADAgADMwAD2VJTDPcbC8T2BqMOAg'], cifr_chat, hi_cifr,
     ['CAADAgADjAADg8cnEZz_9rSktUkNAg']],
    [['🐬🐬🐬'], ['CAADAgADiQADP_vRD4cJCxtGkwY0Ag'], 0, ["О, ИТАЛИЯ НАЧАЛАСЬ"], []],
    [[], ['CAADAgADHgAD6gKUEl9xLyPpAAFHBgI'], zoloto_chat, ["Погоди, сейчас выдам Дипа"], []],
    [[], ['CAADAgADZgADhzHUD8vWtQEsl3zaAg', 'CAADAgADCQADO9HBD09qppDfqW_HAg', 'CAADAgADcAADhzHUD82gOZvLAAFdEAI'],
     0, ['УЛЕЙ'], []],
    [['КОГО?', 'КОГО'], [], 0, ["МИРАКЛЮ"], []],
    [['D:', 'ВЖ'], [], 0, ['/UTYUG'], ['CAADAgADAQADjW7LE45SqDkRKtyzAg', 'CAADAgADGwADsjRGHuBFiQgG41R0Ag',
                                       'CAADAgADjAADsjRGHrkIcAsCdzOMAg']],
    [[], ['CAADAgADAQADjW7LE45SqDkRKtyzAg'], undo_chat, ["УНДЮЖОЧЕК!"], ["CAADAgADMgADg8cnEWp3ie4jNHg-Ag"]],
    [['D: D: D:', 'ВЖ ВЖ ВЖ'], [], 0, [], ['CAADAgADAgADjW7LE_v50VPsaKSvAg']],
    [[], dlinnohead, cifr_chat, ['СПАСИБО ЗА ДЛИННОКОТА, СЕРЁЖА!', '', ''],
     ['CAADAgADawADg8cnEX6Ppa2_ElfUAg', 'CAADAgADlgIAAmMr4glN9I0DbTqtTgI', 'CAADAgADjAADg8cnEZz_9rSktUkNAg']],
    [[], ['CAADAgADBQAD2VJTDOfoIDVZCU5zAg'], cifr_chat, [], ['CAADAgADAwAD2VJTDHENEIKamV7uAg']],
    [['ДИТЯ МОЁ!'], [], citrus_chat, ['ЧТО ТАКОЕ, МАМОЧКА?'], []],
    [["НА ЛУГУ ПАСУТСЯ КО?"], [], 0, ['РИН-НЕ-КО!'], []],
    [[], ['CAADAgADFQADjW7LE9KuwWZCfoYDAg'], 53316498, [],
     ['CAADAgADFwEAAjZ2IA7giFsvKRgOLgI', 'CAADAgADXAQAAuce7AUmmbsbikWzNAI', 'CAADAgADIQEAAlUvqgHwAAEIkuRrIU0C']],
    [[], ['CAADAgADIQADjW7LE9g1jqY9nf9XAg'], 0,
      ['https://youtu.be/pzUYYUuk2ys', 'https://youtu.be/Sh85jKmNhaE', 'https://youtu.be/nimqH_NDpdU',
       'https://youtu.be/hTaaKpJmt40', 'https://youtu.be/6nY9Cp4WZnI', 'https://youtu.be/8fFrEiKqGEA',
       'https://youtu.be/0ZF3rm86Ws4', 'https://youtu.be/3AZ5f_4_t1o', 'https://youtu.be/kZ2V8tJ-Q4c',
       'https://youtu.be/j6rrI6X0to4', 'https://youtu.be/JaciHAcvlyA', 'https://youtu.be/1Vxet85Bk0c',
       'https://youtu.be/L4H4uy9DAK4', 'https://youtu.be/QtnM-igAaTE', 'https://youtu.be/XvVij3q0sk0',
       'https://youtu.be/7OaoxICcBoM', 'https://youtu.be/k4UU-iHLc1s', 'https://youtu.be/5WxHF_NTnC8'], []],
    [['D: D: D: D: D: D: D: D: D: D:'], [], 0, [], ['CAADAgADHQADjW7LE5T5heR8tu6uAg']],
    [[], ['CAADAgADHQADO9HBD8DTsJ6PcoXXAg'], rinneko_chat, ['О, РИНЕЙКА.\nЗАКИДЫВАТЬ МОЛНИЯМИ!',
                                                            'О, РИННЕКО.\nЗАКИДЫВАТЬ МОЛНИЯМИ!',
                                                            'О, РИНЖЕНЕР.\nЗАКИДЫВАТЬ МОЛНИЯМИ!',
                                                            'О, КОТЕЙКА.\nЗАКИДЫВАТЬ МОЛНИЯМИ!'], []],
    [[], ['CAADAgADjQADP_vRD6t7L9YKnP1eAg'], 44989459,
     ["https://pp.userapi.com/c639627/v639627599/5b009/flPJ3T4a_o8.jpg"], ['CAADAgADoQADg8cnEW-_9xNR4RKLAg']],
    [[':D:'], [], 0, [], ['CAADAgADGgADjW7LE0g-GMhzIUFiAg']],
    [['РИННЕКО', 'РИН-НЕ-КО', 'РИННЕКО!', 'РИН-НЕ-КО!'], [], rinneko_chat, [], ['CAADAgADxAADP_vRD-wohLnM0GMRAg']],
    [[], ['CAADAgADKwQAAuce7AWo_pyLoNBvLgI'], 196345058, ['О, НАТАЛИЯ НАЧАЛАСЬ'], []],
    [["1Л"], [], 0, ["2Л"], []],
    [["/ТИХО РЖЁТЬ/"], [], osa_chat, ["ГРОМЧЕ!"], []],
    [["/АРЁТ/"], [], osa_chat, [], ['CAADAgADDQADdUTxCP-onsxKIsJqAg']],

    [[], ['CAADAgADpgEAAmDrzgNSIT8rlE3K0AI', 'CAADAgADVQADsjRGHmcXPWcGP2BfAg'], 0, [], [], "task_rework"],
    [fail_phrase, ['CAADAgADFAADjW7LE9E1TbwjuTk7Ag'], 0, [], [], "task_fail"],
    [approve_phrase, ['CAADAgAD4QADNnYgDo3M52SK-Y3iAg'], 0, [], [], "task_complete"],
    [['КЛАЦ!'], [], 0, [], [], "task_extra"],
    [["НАТАЛЬЯ?"], ['CAADAgADIwADP_vRD4CXRh4oYhhXAg', "CAADAgADHwADP_vRD3g8MWNndtchAg"], 0,
        ['НАТАЛИРУЙ', "@Abi_Abigale"], ["CAADAgADJAADP_vRDykJokH6fiyLAg"], "natalka"],
    [['ВЫГОНИ ПРОЧЬ ЭТИХ НАДОЕДЛИВЫХ БОТОВ!'], [], citrus_chat, [], [], "kick_bots"],
    [['ЗАБАНЬТЕ МЕНЯ НА ПАРУ ЧАСИКОВ'], [], 0, [], [], "kick_lyuds"],
    [['АНТИКЛАЦ!'], [], 0, [], [], "anti_task"],
    [[], ['CAADAgADnAADg8cnESB0jVNnakYoAg'], 0, [], [], "whois"],
    [["ПЕРЕНОСИМ"], [], 0, [], [], "stop_natalka"],
    [[], ['CAADAgADLgADsjRGHsGbRuS2PA26Ag'], 0, [], [], "kick_citrus"],
    [[], ['CAADAgADKAADO9HBD1SvkhGZJT_BAg', 'CAADAgADVwADO9HBD35E69ryx07IAg'], 0, [], [], "kick_rels"],
    [[], ['CAADAgADLwADsjRGHvSXP4ESf3tIAg'], 0, [], [], "kick_misha"],
    [["ОТВЕТЬ НА СООБЩЕНИЕ НАД ЭТИМ", "ЧАТ ЗАЖЕВАЛО"], [], 0, [], [], "message_above"],
    [["АЛЬФА", "ОМЕГА"], [], 0, [], [], "alpha_change"],
    [['С ПЕРВЫМ АПРЕЛЯ!'], ['CAADAgADKAADsjRGHteLnmyyI7GCAg'], 0, [], [], "dura_approve"],
    [[], ['CAADAgADdwADg8cnESvsIyQE4i-zAg'], 0, [], [], "dura_fail"],
    [[], ['CAADAgADkQADsjRGHofugN6VvDUUAg'], 0, [], [], "dura_win"]
]

superreactions = [
    [["МИРАКЛЮ"], [], 0, ["КОГО?"], []],
    [["ВОУ ВОУ", "ВОУ-ВОУ"], [], 0, [], ['CAADAgAD9wADP_vRD4s-yYzXKDzSAg']],
    [memory, [], 0, ["МЕМОРИ!", "ОППА!", "ПЕЙ!"], ['CAADAgADKgADjW7LE7-3bb9S-fuoAg'], "mem_react"],
    [['ДАЙТЕ ЗВЁЗДОЧКУ', 'ПОДАРИ МНЕ ЗВЕЗДУ'], [], 0, [], [], "set_admin"]


                  ]

mssg_bv = ["ДА ННА!", "ДЕРЖЫ", "НИЧЕГО БЕЗ МЕНЯ НЕ МОЖЕШЬ", 'А ЧТО ОТВЕТИТЬ-ТО?']

help_list = ['см. /donate', 'А ЧТО ТУТ НЕПОНЯТНОГО?', 'АЙ НИД СОМБАДИ', '8-800-555-35-35', ';)',
             'ХОДЯТ СЛУХИ, ЧТО ВЗЯТКА СОЗДАТЕЛЯМ ПОМОГАЕТ В ПРОХОЖДЕНИИ ЗАДАНИЯ',
             "ХОЧЕШЬ МНЕ ПОМОЧЬ? У МЕНЯ КАК РАЗ ЕСТЬ ДЛЯ ТЕБЯ ЗАДАНИЕ!",
             "ТЫ НЕ ПОЛУЧИШЬ ЗАДАНИЕ ЧАЩЕ ЧЕМ РАЗ В СУТКИ", "ЕСЛИ ЧОТ НЕ НРАВИТСЯ — ТАК И ПИШИ", "СЛАБО БЕЗ ПОДСКАЗОК?",
             "ГАЙДЫ ЕСТЬ НА ЮТУБЕ", "ЕСЛИ НОВЫЙ ДЕНЬ НЕ НАЧАЛСЯ — ПОДОЖДИ ДО ЗАВТРА",
             "ЗАДАНИЕ РЕДКО ДЛИТСЯ ДОЛЬШЕ ТРЁХ ЧАСОВ.",
             "Я ВЕРЮ, У ТЕБЯ ВСЁ ПОЛУЧИТСЯ!", "НЕ ТА КНОПКА", "ХВАТИТ ТЫКАТЬ", "ЗАДАНИЕ СТАНЕТ ДОСТУПНО НА ЧАС ПОЗЖЕ.",
             "ХОТИТЕ СПОЙЛЕРЫ?", "Взять задание получится только в чате. А МАЙТАСКНУТЬ МОЖНО И В ЛИЧКЕ С БОТОМ",
             "ВАЛЕРА НЕНАСТОЯЩИЙ!", "https://www.youtube.com/watch?v=_sCyzrW7uqM",
             "БОЛЬШЕ ЗАДАНИЙ — РЕЖЕ ПОПАДАЮТСЯ НОЖНИЦЫ", "НЕ ВЗРОСЛЕЙТЕ, ЭТО ЛОВУШКА.",
             "ЧТО-ТО ДЛИННОЕ ЕЩЁ — ЭТО НЕ ПРО УНХУ.", 'https://pp.userapi.com/c639416/v639416750/62b6a/d6-0vpqdHNY.jpg',
             "НЕ УВЕРЕН, ЧТО ТЕБЕ ЗАСЧИТАЮТ, ЕСЛИ ВЫПОЛНЕНИЕ БУДЕТ ВНЕ ЭТОГО ЧАТА.",
             'https://sun9-13.userapi.com/c840529/v840529646/e972/OLQdexG5k0s.jpg']
donate_list = ['С ТЕБЯ ПИВО', 'С ТЕБЯ ЛИМЕРИК', 'С ТЕБЯ ФОТОЧКА', "С ТЕБЯ ГОЛОС", 'С ТЕБЯ ОБНИМАШКИ^^',
               'ПРИШЛИ СВОЙ ВАРИАНТ ЗАДАНИЯ',
               'Поздравляю! Вы подключили услугу VIP-VIP-VIP. Теперь все задания для Вас платные.', '/donate',
               "ОТПРАВЬ ЗАРЯДЫ: ДИПУ — 30% ЗА БОТА, ЦИТРУСУ — 30% ЗА ЗАДАНИЯ И #зелёныйаксолотль (тм), "
               "ЛИИРЕ И СУПЕРУ ПО 10% ЗА СТИКЕРЫ, ШЬЮЗЕН — 20% ЗА СЕРВЕР",
               "НЕ ЗАБУДЬ ПОКОРМИТЬ СОЗДАТЕЛЕЙ НА БЛИЖАЙШЕЙ РАКОНОСХОДКЕ", "СДЕЛАЙ ХОД!",
               "ТЕПЕРЬ ТЫ ПОПЛАТИШЬСЯ!", "ОТ РАСПЛАТЫ НЕ УЙДЁШЬ!", "РАБОТАЮ ЗА СПАСИБУ. А ПАПА С МАМОЙ - НЕТ",
               "Я ТЕБЯ ЗАПОМНИЛ!", "ПРОИГРАЛ", 'НАРИСУЙ СТИКЕР С АКСОЛОТЛЕМ. БОЛЬШЕ СТИКЕРОВ — БОЛЬШЕ ЗАДАНИЙ']

bonus_20 = ['CAADAgADVAADg8cnEcm03ptpBsCDAg','CAADAgADYgADg8cnEdE4AfXc_eRPAg', 'CAADAgADrAADg8cnEVlHYI9p1ns9Ag',
            'CAADAgADZgADg8cnEZrVXf7N7QlVAg', 'CAADAgADtgADg8cnEajz_hf3D4kDAg',
            'CAADAgADtwADg8cnEfE3BUFfws6pAg', 'CAADAgADBgADsjRGHsWkhlxIc8GWAg']

cats = [
['CAADAgADRgAD2VJTDCSJuBLsA8EXAg', 'CAADAgADWgAD2VJTDKL0iSC-44aLAg', 'CAADAgADWwAD2VJTDOndp5isfAvfAg',
'CAADAgADXAAD2VJTDEAgBQABHYdpiwI', 'CAADAgADXQAD2VJTDDIwCca90F-hAg', 'CAADAgADaAAD2VJTDCbM00lF-zPSAg',
'CAADAgADaQAD2VJTDPTjTsSJN1cMAg', 'CAADAgADagAD2VJTDOrPN5hWJ1_oAg', 'CAADAgADawAD2VJTDKX2PXLOb36zAg',
'CAADAgADbAAD2VJTDOLa5iqfwCvsAg'],
['CAADAgADXgAD2VJTDGVStjr7cvzxAg', 'CAADAgADXwAD2VJTDL7IOLRnErEfAg', 'CAADAgADYAAD2VJTDLuGDanbFjBuAg',
'CAADAgADYQAD2VJTDOyqjmU3edYLAg', 'CAADAgADYgAD2VJTDCu6Tqi8mSgBAg', 'CAADAgADbQAD2VJTDGrW3mKDorMsAg',
'CAADAgADbgAD2VJTDOKoN5bH5kiuAg', 'CAADAgADbwAD2VJTDDQINiyPNbWnAg', 'CAADAgADcAAD2VJTDKRhUDtv6AoUAg',
'CAADAgADcQAD2VJTDO0FzJ-fDvoaAg'],
['CAADAgADYwAD2VJTDAfJEH1WEBdSAg', 'CAADAgADZAAD2VJTDBXQbdYgBxILAg', 'CAADAgADZQAD2VJTDONoA5KeRvaVAg',
'CAADAgADZgAD2VJTDFjxfzVCsT5pAg', 'CAADAgADZwAD2VJTDI7UQTS5UQMZAg', 'CAADAgADcgAD2VJTDKUKLQ1x0hhhAg',
'CAADAgADcwAD2VJTDH_94YCAGDEyAg', 'CAADAgADdwAD2VJTDKDyVwrFrlHFAg', 'CAADAgADeAAD2VJTDNSJtyPtKqeKAg',
'CAADAgADeQAD2VJTDE4hW6LVZGCDAg']]
# format: sticker + task
tasks = [['CAADAgADSgADP_vRD6EHNhBBV7W_Ag', 'ТЫ ДИП. ИСПОЛЬЗУЙ ДИПЯНКУ БЛИЖАЙШИЕ 300 СООБЩЕНИЙ.', 0, 300, "deep_check"],
         ['CAADAgADSAADP_vRDxb1PT65ZcS8Ag', 'ТЫ ЦИТРУС. СПОЙ ПЕСЕНКУ ВСЛУХ.', 23, 0],
         ['CAADAgADQgADP_vRDyRMg2vP6pd8Ag', 'ТЫ АРЕАТАНГЕНТ. ОТПРАВЛЯЙ КАЖДУЮ КАРТИНКУ И СТИКЕР ДИСТОРШН БОТУ БЛИЖАЙШИЕ'
                                            ' 100 СООБЩЕНИЙ И ПОКАЗЫВАЙ НАМ.', 0, 100],
         ['CAADAgADWAADP_vRD8CYBmhcMhZxAg', 'ТЫ ЧЕТЫРЕ)))) ТРИ ЧАСА ПИШИ СО СКОБОЧКАМИ))))', 3, 0],
         ['CAADAgADWgADP_vRD_VQ9Woa3bIOAg', 'ТЫ ЗЛОЙ АДМИН. ПОПРОСИ АДМИНА КОГО-НИБУДЬ ЗАБАНИТЬ НА ПАРУ ЧАСОВ ИЛИ'
                                            ' СДЕЛАЙ ЭТО САМ, ЕСЛИ У ТЕБЯ ЕСТЬ БАНХАММЕР.', 23, 0],
         ['CAADAgADVAADP_vRD-VGSEORarUwAg', 'ТЫ НОРМАЛЬ. ПРОБЕЙСЯ В ТОП-3 ПО ФЛУДУ ЗА ДЕНЬ.', 23, 0],
         ['CAADAgADXwADP_vRD-j0lU68FiFsAg', 'ТЫ ГОДВИЛЛЬ. ЭКОНОМЬ ВИРТУАЛЬНОЕ ПРОСТРАНСТВО, ПИШИ БЗ ГЛСНХ.', 3, 300,
          "gdvll_check"],
         ['CAADAgADdQADP_vRDwPTSwahmq5oAg', 'ТЫ ИИОО. НЕ СДЕРЖИВАЙ СВОЮ НЕНАВИСТЬ К СОГЛАСНЫМ, ПИШИ ИХ НЕ БОЛЕЕ'
                                            ' ДВУХ ШТУК В СЛОВЕ.', 3, 300, "iioo_check"],
         ['CAADAgADWQADP_vRDxArNUvEnLZiAg', 'ТЫ БАГ. СЛОМАЙ ГОДВИЛЛЬ, МЕНЯ ИЛИ ЛЮБОГО ДРУГОГО БОТА. ИЛИ НАЙДИ '
                                            'НОВУЮ ФИЧУ В ИЗВЕСТНОМ БОТЕ', 23, 0],
         ['CAADAgADagADP_vRDy9WxzZxe_NUAg', 'ТЫ ЭЛЕКСОРИЕН. ПЕРЕИМЕНУЙСЯ НА ВЕСЬ ДЕНЬ И ПОМЕНЯЙ ПОЛ.', 23, 0],
         ['CAADAgADbAADP_vRD6Xn7qb5y-9YAg', 'ТЫ АНАЛЕПТИК. ПОСТАВЬ КОМУ-НИБУДЬ АНАЛИЗ ПО АВАТАРКЕ.', 23, 0],
         ['CAADAgADSwADP_vRD5Fg55OC3EGYAg', 'ТЫ ПУШИСТЫЙ ТРИББЛ. ставь точки. и не забывай писать всё с '
                                            'маленькой буквы.', 3, 300, "tribbl_check"],
         ['CAADAgADRgADP_vRD5ypDI2RyuAxAg', 'ТЫ СИЛЬФУР. НАДЕНЬ МАСКУ ДРУГОГО ИГРОКА И ВЫПОЛНИ ЕГО ЗАДАНИЕ'
                                            ' БЫСТРЕЕ ИЛИ ЛУЧШЕ', 23, 0],
         ['CAADAgADQAADP_vRD85Bwdr_xrWpAg', 'ТЫ СУПЕР ТРУПЕР. ИСПОЛЬЗУЙ КАКИЕ-НИБУДЬ НЕОБЫЧНЫЕ СИМВОЛЫ В КАЖДОМ '
                                            'СООБЩЕНИИ.', 3, 300, "super_check"],
         ['CAADAgAD2wADP_vRDzddQ9uHFfpoAg', 'ТЫ ЭЛЛИОТТ. ОТВЕДИ КОГО-НИБУДЬ НА ВЫХОД, ЛОГ В СТУДИЮ.', 23, 0],
         ['CAADAgADVQADP_vRD3lc6Dt9R8B_Ag', 'ТЫ ЛЕОНАРДО. СПИЛИ ТРОИХ В ОДНОМ ПОДЗЕМЕЛЬЕ, ЛОГ В СТУДИЮ.', 23, 0],
         ['CAADAgAD4gADP_vRD-f8UtxJAAHAIAI', 'ТЫ МОРСКАЯ ОСА. ПРОЧИТАЙ ВСЛУХ КРАСИВОЕ СТИХОТВОРЕНИЕ И ПРИШЛИ '
                                             'В ЧАТ.', 23, 0],
         ['CAADAgADbwADP_vRD5PpTSaCriwYAg', 'ТЫ ШИЗИК. ПИШИ ПРО ВСЕХ ГАДОСТИ, НО УДАЛЯЙ ЧЕРЕЗ ПАРУ СООБЩЕНИЙ', 3, 300],
         ['CAADAgADQQADP_vRD5i0jEorKyN1Ag', 'ТЫ ЛИИРА. НАРИСУЙ КРАСИВУЮ КАРТИНКУ И ПОКАЖИ НАМ', 23, 0, "liira_check"],
         ['CAADAgADcgADP_vRD2nt1nzmOx8JAg', 'ТЫ О ЖИ. БУМАГА! НАЙДИ, КОГО ТЫ ЕЮ МОЖЕШЬ '
                                            'ПОБЕДИТЬ!', 23, 0, "bumaga_check"],
         ['CAADAgADYAADP_vRD1pLEzSHlvVlAg', 'ТЫ МИХЕЙ. ТЫ ПОЙМАЛ САЧКОМ КАМЕНЬ. НАЙДИ, КОГО ТЫ ИМ МОЖЕШЬ '
                                            'ПОБЕДИТЬ!', 23, 0, "kamen_check"],
         ['CAADAgADDQADsjRGHk6CZzMf4hDyAg', 'ТЫ ВЗЯЛ В РУКИ НОЖНИЦЫ ДЛЯ МЕДИЦИНСКИХ ИССЛЕДОВАНИЙ. '
                                            'НАЙДИ, КОГО ТЫ ИМИ МОЖЕШЬ ПОБЕДИТЬ.', 23, 0, "nozhn_check"],
         ['CAADAgADRAADP_vRD1MBUKl5_67DAg', 'ТЫ ФИЛАШТЕКЬЮ. ПИШИ TRANSLITOM.', 3, 300, "fylhtq_check"],
         ['CAADAgADcwADP_vRD2eyQ2jFa1PFAg', 'ТЫ ХЕЛЕНАК. ЗАПИРАТЬ КОГО-ТО В МОРЕ И ПОКИНЬ ЕГО С СОКРОВИЩЕМ.'
                                            ' ЛОГ В СТУДИЮ.', 23, 0],
         ['CAADAgADWwADP_vRD-3zlimm1gABOwI', 'ТЫ КАПЛЯ ЯНТАРЯ. ИШИП ЕСВ АВОЛС ТОРОБОАН.', 3, 300],
         ['CAADAgADcQADP_vRD7RRN9-SsTcAAQI', 'ТЫ АЙСБРЕХЕР. ПОСЛЕ ТАБЛЕТОК У ТЕБЯ В ЧАТЕ ЕСТЬ ВООБРАЖАЕМЫЙ ДРУГ', 23, 0],
         ['CAADAgADYgADP_vRDwhMWn-LcpW1Ag', 'ТЫ ПОЛИНОМ ГАУССА. ПОПРОСИ У МИШИ ЗАДАЧКУ ПО МАТАНУ И РЕШИ ЕЁ', 23, 0],
         ['CAADAgADTQADP_vRD9M3gnprJHMsAg', 'ТЫ ФОБЕР. ПОЯВЛЯЙСЯ В ЧАТЕ НЕ ПОЗЖЕ ЧЕМ ЧЕРЕЗ 5 МИНУТ ПОСЛЕ'
                                            ' УПОМИНАНИЯ О ТЕБЕ', 10, 0, "fober_check"],
         ['CAADAgADRwADP_vRD7PXCM29pqK2Ag', 'ТЫ ДЛИНОМОЗГ. С Т А В Ь  П Р О Б Е Л  П О С Л Е  К А Ж Д О Й '
                                            ' Б У К В Ы .', 3, 300, "mozg_check"],
         ['CAADAgADZwADP_vRD1eol4dMSWiYAg', 'ТЫ ВЕЗУНЧИК. ПОПРОБУЙ ДОБИТЬСЯ У ПУШКА 100% ВЕРОЯТНОСТИ ЗА 5 ПОПЫТОК.', 23, 0],
         ['CAADAgADiAADP_vRD7m6NPkFdD5AAg', 'ТЫ ФАЛЛИК СИМБОЛ. ПОСТАВЬ СЕБЕ НА АВАТАРКУ ПОСЛЕДНЮЮ ПРИСЛАННУЮ В'
                                            ' ЧАТ КАРТИНКУ И НОСИ ЕЁ ЦЕЛЫЕ СУТКИ.', 23, 0],
         ['CAADAgADYwADP_vRDyRf9XlT7-wAAQI', 'ТЫ МАЛЕФИКА. ПРЕДСКАЖИ, КАКОЕ ИЗ СЕЙЧАС ВЗЯТЫХ ЗАДАНИЙ НЕ БУДЕТ'
                                             ' ВЫПОЛНЕНО.', 23, 0, "malefika_check"],
         ['CAADAgADbQADP_vRD9OhnOLMd_0SAg', 'ТЫ АНДАРЧ. ДОВЕДИ ЧАТ ДО РУГАНИ И ИСТЕРИК', 23, 0],
         ['CAADAgADVgADP_vRD3SPhVKzmhepAg', 'ТЫ ДЖЕЙ ДЖИ. СПИЛИ ОДНОЧАТОВЦА И НАПИШИ ЕМУ ПИТАФЬЮ', 23, 0],
         ['CAADAgADUgADP_vRD9IDWofQEWenAg', 'ТЫ КАТИССА. МОЛЧИ В ЧАТЕ ДО ЗАСЧИТЫВАНИЯ ЭТОГО '
                                            'ЗАДАНИЯ', 6, 0, "katissa_check"],
         ['CAADAgADQwADP_vRDwwu0nJlgL--Ag', 'ТЫ МУХА-ХА. ДОПИСЫВАЙ-ВАЙ К КАЖДОМУ-МУ СЛОВУ-ВУ ПОСЛЕДНИЙ-НИЙ СЛОГ-СЛОГ'
                                            ' ЧЕРЕЗ-РЕЗ ДЕФИС-ФИС', 3, 0],
         ['CAADAgADXAADP_vRDzfiKs97z6teAg', 'ТЫ ВАЛИНОР. СДЕЛАЙ ИНТЕРЕСНУЮ ПОДЕЛКУ СВОИМИ РУКАМИ', 23, 0],
         ['CAADAgADbgADP_vRD9aHxI_AWtYXAg', 'ТЫ МЕДИА. ПШИ ВЕС СЛВОА С ОЩТБКАМТ И ОПЧЕАТКПМИ', 3, 0],
         ['CAADAgADZQADP_vRD56tnWbB-VQxAg', 'ТЫ ПАТРИСИЯ. ПОМОГИ ДРУГИМ ПОЗНАТЬ СИЛУ ЧТЕНИЯ, ПИШИ В КАЖДОМ СООБЩЕНИИ,'
                                            ' ДАЖЕ В САМОМ МАЛЕНЬКОМ, БОЛЬШЕ ДВАДЦАТИ СЛОВ ИЛИ ХОТЯ БЫ '
                                            'СТОЛЬКО', 3, 0, "patricia_check"],
         ['CAADAgADXgADP_vRD3BPWr6Hatf3Ag', 'ТЫ АЛФОРЧУ. УБЕЙ СВОИМ СООБЩЕНИЕМ ЭТОТ ЧЯТИК ХОТЯ БЫ НА '
                                            'ПОЛЧАСИКА', 23, 0, "all4u_check"],
         ['CAADAgADSQADP_vRD70FjV4JQZgtAg', 'ТЫ НАРЕЗНОЙ. ПИШИ ГРАМОТНО, НЕ ДОПУСКАЯ НИ ЕДИНОЙ ОШИБКИ И ИСПОЛЬЗУЯ'
                                            ' ЗНАКИ ПРЕПИНАНИЯ ЛИШЬ ТАМ, ГДЕ ЭТО НЕОБХОДИМО.', 3, 300],
         ['CAADAgADXQADP_vRD-iDlwPCIpAAAQI', 'ТЫ ТОТО РО. ПРИШЛИ СВОЁ ФОТО, ЗАМЕНИВ ГЛАЗА НА ОНЕМЕШНЫЕ', 23, 0],
         ['CAADAgADYQADg8cnEaHZyTdEZp_CAg', 'ТЫ САРАСТИ. КОГДА ЭТО ЗАДАНИЕ ВИДИТ ДИП, ОН ПИШЕТ ПРОИГРАЛ, КОГДА ЗАДАНИЕ'
                                            ' ВИДЯТ УХИ - ОНА ПИШЕТ МОЛОДЕЦ! САРАСТИ!', 23, 0],
         ['CAADAgADYwADg8cnEdtr9V3W8N4uAg', 'ТЫ ЗОЛОТАНАНА. УСТРОЙ СТИКЕРШТОРМ, ОБЩАЙСЯ ТОЛЬКО '
                                            'СТИКЕРАМИ.', 6, 0, "zoloto_check"],
         ['CAADAgADawADP_vRD5QLu3L8N_ZHAg', 'ТЫ ХИРОПСАЛ. ВЫЙДИ ПОДЫШИ СВЕЖИМ ВОЗДУХОМ, ПОКАТАЙСЯ НА ВЕЛОСИПЕДЕ...'
                                            ' И НЕ ЗАХОДИ В ГОДВИЛЛЬ ЦЕЛЫЕ СУТКИ!', 23, 0],
         ['CAADAgADcwADg8cnEZx3unc6oDfSAg', 'ТЫ РИТЕР. НЕ ОТВЕЧАЙ НА ОБРАЩЕНИЯ К ТЕБЕ И ВСЯЧЕСКИ ИГНОРИРУЙ'
                                            ' СОБЕСЕДНИКОВ', 3, 0],
         ['CAADAgADjQADP_vRD6t7L9YKnP1eAg', 'ТЫ РЕЛЬС. ПРОСНИСЬ СЛЕДУЮЩИМ УТРОМ ПОРАНЬШЕ И КАК СОЛНЫШКО ПРИВЕТСТВУЙ'
                                            ' КАЖДОГО, КТО ПРОСЫПАЕТСЯ В ЧАТЕ.', 23, 0],
         ['CAADAgADdAADP_vRD-h8X2Sfq0z3Ag', 'ТЫ ИСКУСАТЕЛЬНИЦА. ПЕРЕРИСУЙ АВАТАРКУ ТОГО, КТО НАПИСАЛ В ЧАТ ПЕРЕД '
                                            'ЭТИМ ЗАДАНИЕМ, ЧТОБЫ БЫЛО КРАСИВЕЕ.', 23, 0],
         ['CAADAgADpwADP_vRD24GxeByH7rOAg', 'ТЫ НЕВЫРАЗИМОЕ НЕЧТО. ЗАПУСТИ В ЧЯТ ИГРУ И ОСТАВАЙСЯ В НЕЙ ЛИДЕРОМ', 23, 0],
         ['CAADAgADTAADP_vRDyyAvXeXlxFqAg', 'ТЫ ШИЛА. ВЕДИ СЕБЯ КАК АЛЬФА-САМКА, ДОМИНИРУЙ, КАДРИ САМЦОВ.', 3, 0],
         ['CAADAgADaAADP_vRD174n-wtKXsPAg', 'ТЫ ЕВРОПОНТ. ВЕДИ СЕБЯ КАК АЛЬФА-САМЕЦ, ДОМИНИРУЙ, КАДРИ САМОК.', 3, 0],
         ['CAADAgADkgADP_vRD5Do1teydn2XAg', 'ТЫ МАРИЯ К. ОБРАЩАЙСЯ КО ВСЕМ ПО ИМЕНИ.', 3, 0],
         ['CAADAgADUwADP_vRD-2HWxdAKMamAg', 'ТЫ РЕИНМАР. ЗАМЕНЯЙ СЛОВА В ПРЕДЛОЖЕНИЯХ НА ПРОТИВОПОЛОЖНОЕ ПО СМЫСЛУ', 3, 0],
         ['CAADAgADcAADP_vRD6O-hLUgsLoiAg', 'ТЫ ЧЕРНОСНЕЖКА. ДОБАВЛЯШКАЙ КО ВСЕМ СЛОВЕЧКАМ '
                                            'УМЕНЬШИТЕЛЬНЕНЬКО-ЛАСКАТЕЛЬНИНЬКИЕ СУФФИКСЯШКИ', 3, 0],
         ['CAADAgADqAADP_vRDzWO5UxDtA5IAg', 'ТЫ НМЛСС. ПРОСЛЕДИ ЗА ИГРОКАМИ И СДЕЛАЙ ДОНОС ПРОВЕРЯЮЩИМ НА '
                                            'ТРЁХ ПРОИГРАВШИХ.', 23, 0],
         ['CAADAgADuQADP_vRDyjU3H-1Hhh8Ag', 'ТЫ ЦФР. С ПЕРВОЙ ПОПЫТКИ ОТПРАВЬ ДЛИННОКОТА ИЗ ПЯТИДЕСЯТИ ФРАГМЕНТОВ ПО '
                                            'ОДНОМУ, ЧТОБЫ ТЕБЯ НИКТО НЕ ПЕРЕБИЛ.', 23, 0],
         ['CAADAgADuAADP_vRDz-UigMDJvwcAg', 'ТЫ УНДО. ДОЖДИСЬ ВЕЧЕРА И НАПИШИ УНДОГЛЮКИ ЗА ЭТОТ ДЕНЬ', 23, 0],
         ['CAADAgADwwADP_vRD2rk840lb64ZAg', 'ТЫ АБИГЕЙЛ. РАССКАЖИ ГРУСТНУЮ ИСТОРИЮ ИЗ СВОЕЙ ЖИЗНИ.', 23, 0],
         ['CAADAgADZgADP_vRDz0QFgOSXd-oAg', 'ТЫ ПЛЕЯНА. ПИШИ ТОЛЬКО ТЕ СЛОВА, КОТОРЫЕ НАЧИНАЮТСЯ НА БУКВУ "П".', 3, 0],
         ['CAADAgAD4QADP_vRD6YmoaP3mloVAg', "ТЫ АРУЛУТ. НАДЕНЬ АВУ, НИК И МАНЕРУ ОБЩЕНИЯ ДРУГОГО ИГРОКА.", 23, 0],
         ['CAADAgAD4wADP_vRD3P1rDM_KtGuAg', "ТЫ РИННЕКО. СООБЩАЙ О ПРИБЛИЖЕНИИ ЯРЕНЫ ЗА НЕСКОЛЬКО МИНУТ ДО ТОГО,"
                                            " КАК ЭТО СДЕЛАЕТ БОТ.", 23, 0],
         ['CAADAgADwgADP_vRDwFfN7W0PLTBAg', "ТЫ МОРСКАЯ ОСА. РАССКАЖИ, ЧТО ТЕБЕ СЕГОДНЯ ПРИСНИЛОСЬ. ЕСЛИ НИЧЕГО НЕ"
                                            " ПРИСНИЛОСЬ — БАЯЗИД.", 23, 0],
         ['CAADAgADyAADP_vRDw6_aW_q_VzrAg', "ТЫ УНХАЙЛИГ.\nНАПИШИ ХОККУ\nВ ДУЭЛИ САМЫЙ КОНЕЦ.\nОДИН ГЛАС - СТРОЧКА.", 23, 0],
         ['CAADAgADVwADP_vRD5bgjp3IrnbZAg', 'ТЫ ПОКРОВИТЕЛЬ БАРСИКОВ. ПИШИ В ЧАТ ИСКЛЮЧИТЕЛЬНО ФРАЗАМИ ИЗ ДНЕВНИКА.', 23, 0],
         ['CAADAgAD5gADP_vRD6qWm53Gw7r4Ag', 'ТЫ ТРИШШШ. ЛЯГ СПАТЬ ВОВРЕМЯ.', 23, 0],
         ['CAADAgAD5wADP_vRDxoeWciKsGI5Ag', 'ТЫ НЕ ТВОЯ МАЛЫШКА. НАЧИНАЙ ВСЕ СВОИ СООБЩЕНИЯ СО СЛОВ "Я НЕ ГЕЙ".', 23, 0],
         ['CAADAgAD3AADP_vRD-MYOKSjfpS0Ag', 'ТЫ НЕВЫРАЗИМОЕ НЕЧТО. ВНИМАТЕЛЬНО СЛЕДИ ЗА КАКИМ-ЛИБО ИГРОКОМ В ТЕЧЕНИЕ '
                                            'ДНЯ И СОСТАВЬ НА НЕГО ДОСЬЕ.', 23, 0],
         ['CAADAgADuwADP_vRD0oR4vt4K4-EAg', 'ТЫ ТЕХХИ ТУОТЛИ. ОТВЕЧАЙ НА СООБЩЕНИЯ В РИФМУ.', 4, 0],
         ['CAADAgAD3wADP_vRD5FjqacICOkMAg', 'ТЫ НОЧНАЯ ГАРПИЯ. /ПРЕКРАЩАЕТ ОБЩАТЬСЯ И ЛИШЬ ОПИСЫВАЕТ '
                                            'СВОИ ДЕЙСТВИЯ/', 4, 0],
         ['CAADAgAD3QADP_vRD7o7aD2Glih_Ag', 'ТЫ РЫЦАРЬ ДОСТАВКИ. АНОНИМНО ДОСТАВЛЯЙ ВСЕ ПИСЬМА И ПОСЛАНИЯ ОТ ДРУГИХ '
                                            'ИГРОКОВ В ЧАТ.', 16, 0],
         ['CAADAgADBQEAAj_70Q-GiGlQo3mwrwI', 'ТЫ ЗОЛОТЦЕ. ОТРЕЖЬ ТОРТИК И СКУШАЙ ЕГО! МЫ КАК ОБЫЧНО ЖДЁМ ФОТОК', 23, 0],
         ['CAADAgADAQEAAj_70Q9jRzFPablxawI', 'ТЫ ХАМПЕР. ПОРАЗГОВАРИВАЙ ЭРОТИЧНЫМ ГОЛОСОМ.', 23, 0],
         ['CAADAgAD5QADP_vRD7Jr45-pXMzoAg', "ТЫ СВЯТАЯ ГИДРОПОНИКА. ПИШИ ЖЫРНЫМИ БУКВАМИ.", 6, 0],
         ['CAADAgADYQADP_vRD4wcSIht1HiGAg', "ТЫ ЮИ-ЛАЛЛИ. НЕ ОТВЕЧАЙ ПРЯМО НА ВОПРОСЫ. УХОДИ ОТ ОТВЕТОВ.", 6, 0],
         ['CAADAgAD4AADP_vRD5mrvGdVMhuvAg', "ТЫ САРАСТИ. У ТЕБЯ САРАМНЕЗИЯ, ДЛЯ ТЕБЯ ЭТО ПЕРВЫЙ ДЕНЬ В ЧАТЕ, И ТЫ О НЁМ НИЧЕГО НЕ ЗНАЕШЬ.", 16, 0],
         ['CAADAgADRQADP_vRD8obt-z-NyEqAg', "ТЫ ПОПИТАС. ВЫБЕРИ ЛЮБОЙ ВЫМЫШЛЕННЫЙ МИР ДЛЯ СВОЕЙ ТРУБКИ И УПОРИСЬ ПО НЕМУ.", 16, 0]



         ]

whitelist = [311689962, 265419583, 150029429, 360910213, 171108866, 325898595, 183217512, 270769101, 53316498, 287819651, 507917490]

black_tasks = [
    ['CAADAgADnAADP_vRD2a0vetXwpdzAg', 'ТЫ ЧОРНЫЙ АРЕАТАНГЕНТ. СОЗДАЙ АКТИВНЫЙ ЧАТ НА 10 ЧЕЛОВЕК И УДАЛИ ЕГО СПУСТЯ '
                                       'СУТКИ.', 23, 0],
    ['CAADAgADnQADP_vRD89N7c9JLwnzAg', 'ТЫ ЧОРНЫЙ ЦИТРУС. СПОЙ ВСЛУХ МАТЕРНУЮ ПЕСЕНКУ И ПРИШЛИ ЕЁ В ЧАТ.', 23, 0],
    ['CAADAgADngADP_vRD3z5P-pTAAE5wgI', 'ТЫ ЧОРНЫЙ ДИП. НАХОДИ ВСЕ ЛОГИЧЕСКИЕ ОШИБКИ ОППОНЕНТОВ И НЕЗАМЕДЛИТЕЛЬНО '
                                        'НА НИХ УКАЗЫВАЙ', 3, 0],
    ['CAADAgADnwADP_vRD1jC4eQFmAJkAg', 'ТЫ ЧОРНАЯ ИСКУСАТЕЛЬНИЦА. ПЕРЕРИСУЙ АВАТАРКУ ИГРОКА, КОТОРЫЙ НАПИСАЛ ДО ЭТОГО '
                                       'ЗАДАНИЯ, ЧТОБЫ БЫЛО ОБИДНО.', 23, 0],
    ['CAADAgADMAADE3yuAiRxGLnG8adyAg', 'ТЫ ЧОРНАЯ ТОТОРО. ПРИШЛИ СВОЁ ФОТО, ВЫРЕЗАВ ОТТУДА ГЛАЗА.', 23, 0],                                   
    ['CAADAgADoAADP_vRDwZOfbvGrhzSAg', 'ТЫ ЧОРНЫЙ ПОЛИНОМ ГАУССА. ЗАДАЙ МИШЕ ЗАДАЧКУ ПО МАТАНУ.', 23, 0],
    ['CAADAgADoQADP_vRD74RXtY5uDaUAg', 'ТЫ ЧОРНЫЙ РЕЛЬС. ПРОСНИСЬ УТРОМ ПОРАНЬШЕ И ЗВОНИ С ПОЖЕЛАНИЯМИ ДОБРОГО УТРА',
     23, 0],
    ['CAADAgADogADP_vRD_rLxu_6ITGyAg', 'ТЫ ЧОРНАЯ МАРИЯ СЕРГЕЕВНА. ОБРАЩАЙСЯ КО ВСЕМ ПО ОТЧЕСТВУ.', 3, 0],
    ['CAADAgADowADP_vRD2Mc_kqxw_zXAg', 'ТЫ ЧОРНЫЙ СИЛЬФУР. ВЫПОЛНИ ЗАДАНИЕ ДРУГОГО ИГРОКА ЛУЧШЕ ИЛИ БЫСТРЕЕ, ОБЕСПЕЧИВ '
                                       'ТАКИМ ОБРАЗОМ БАЯЗИД ЭТОМУ ИГРОКУ.', 23, 0],
    ['CAADAgADpAADP_vRD1icH4V_v8UUAg', 'ТЫ ЧОРНЫЙ ШЕНМАН. ОТПРАВЬ АУДИОСООБЩЕНИЕ ДЛИТЕЛЬНОСТЬЮ ОКОЛО 40 СЕКУНД С КУЧЕЙ '
                                       'СЛОВ ТАК, ЧТОБЫ ВОЙСИ ПРАВИЛЬНО РАСПОЗНАЛА ВСЕ СЛОВА.', 23, 0],
    ['CAADAgADpQADP_vRD7AcdIk76-SsAg', 'ТЫ ЧОРНАЯ ЗОЛОТАНАНА. ОБЩАЙСЯ ТОЛЬКО СТИКЕРАМИ И ТОЛЬКО ИЗ ОДНОГО '
                                       'СТИКЕРПАКА.', 4, 0],
    ['CAADAgADeAADE3yuAnSWjSQq9PfjAg', 'ТЫ ЧОРНЫЙ НАРЕЗНОЙ. У ТЕБЯ ОТОБРАЛИ ПЕЧАТНУЮ МАШИНКУ. ПИШИ ВСЕ СВОИ СООБЩЕНИЯ '
                                       'НА БУМАГЕ, ФОТОГРАФИРУЙ И ПРИСЫЛАЙ НАМ.', 3, 0],
    ['CAADAgADgQADE3yuAg8SnCI2hXtgAg', 'ТЫ ЧОРНЫЙ ИИОО. ИСПОЛЬЗУЙ В СООБЩЕНИЯХ ТОЛЬКО БУКВЫ С ЧЁТНЫМ НОМЕРОМ', 3, 0],
    ['CAADAgADhgADE3yuAvQNwTNI94W-Ag', 'ТЫ ЧОРНАЯ САРАСТИ. ТЫ ПОБЕДИШЬ, ТОЛЬКО КОГДА КТО-ТО ИЗ ТОПА ПОЗОРА ВОЗЬМЁТ '
     'ЗАДАНИЕ', 23, 0],
    ['CAADAgADiAADE3yuAvl6OByada5rAg', 'ТЫ ЧОРНАЯ ШИЛА. КАДРИ САМЦОВ В ЛИЧКЕ. ЗАКАДРИВ, ПРИСЫЛАЙ СКРИНЫ В ЭТОТ ЧАТ.',
     23, 0],
    ['CAADAgADiQADE3yuAh41KaDVzWOXAg', 'ТЫ ЧОРНЫЙ ЕВРОПОНТ. КАДРИ САМОК В ЛИЧКЕ. ЗАКАДРИВ, ПРИСЫЛАЙ СКРИНЫ В ЭТОТ ЧАТ.',
     23, 0],
    ['CAADAgADdgADE3yuAvnM94kUvJuoAg', 'ТЫ ЧОРНАЯ АБИГЕЙЛ. РАССКАЖИ ИСТОРИЮ, КАК ТЫ СДЕЛАЛА ГРУСТНО ДРУГИМ.', 23, 0],
    ['CAADAgADiwADE3yuAn3jwtZfXlKdAg', 'ТЫ ЧОРНЫЙ ШИЗИК. УДАЛЯЙ ВООБЩЕ ВСЕ СВОИ СООБЩЕНИЯ И НЕ ЗАБЫВАЙ ПИСАТЬ ГАДОСТИ.',
     5, 0],
    ['CAADAgADewADE3yuAs27IAESXQ-SAg', 'ТЫ ЧОРНЫЙ ЭЛЛИОТТ. ПРОШАГАЙ ПО ПОДЗЕМУ СТО ШАГОВ ДО ЭВАКУАТОРА.', 23, 0],
    ['CAADAgADFwADE3yuAvaXG1CcLdhmAg', 'ТЫ ЧОРНЫЙ ФИЛАТЕШКЬЮ. ПИШИ ВСЁ АНТИТРАНСЛИТОМ — РУССКИМИ БУКВАМИ, '
                                       'НО АНГЛИЙСКИМИ СЛОВАМИ.', 4, 0],
    ['CAADAgADOAADE3yuAqgcgIiwiTVzAg', 'ТЫ ЧОРНАЯ ПАТРИСИЯ. ВНИМАТЕЛЬНО ЧИТАЙ ЧАТ И ПОМОГАЙ ИСПРАВЛЯТЬ ВСЕ '
     'ГРАММАТИЧЕСКИЕ ОШИБКИ.', 3, 0],
    ['CAADAgADnAADE3yuAv91Oddj1ZzmAg', 'ТЫ ЗЛОЙ ЧОРНЫЙ АДМИН. ВВЕДИ ПРАВИЛО ДЛЯ ЧАТА И СТРОГО МОДЕРИРУЙ ЕГО. '
     'БАЯЗИД, ЕСЛИ САМ НАРУШИШЬ', 6, 0],
    ['CAADAgADSgADsjRGHtQCkmVPbVAAAQI', 'ТЫ ЧОРНАЯ РИННЕКО. ЗАКИДАЙ ЯРЕНЩИКА МОЛНИЯМИ ВО ВРЕМЯ ЯРЕНЫ.', 23, 0],
    ['CAADAgADSwADsjRGHvcy-IV7z1ADAg', 'ТЫ ЧОРНЫЙ АЙСБРЕЙХЕР. ПОСЛЕ ЧОРНЫХ ТАБЛЕТОК У ТЕБЯ ПОЯВИЛСЯ ВООБРАЖАЕМЫЙ ЧАТ.'
                                       ' РАССКАЗЫВАЙ, ЧТО ТАМ ПРОИСХОДИТ.', 4, 0],
    ['CAADAgADNAADsjRGHt8-okdL3EqoAg', 'ТЫ ЧОРНАЯ ВАЛИНОР. СДЕЛАЙ ПОДДЕЛКУ СВОИМИ РУКАМИ.', 23, 0],
    ['CAADAgADfQEAAli9YEoxkfmxSf7aBAI', 'ТЫ ЧОРНЫЙ РИТЕР. ОТВЕЧАЙ НА ВСЁ, ЧТО ТЕБЯ КАСАЕТСЯ, НО НЕ РАНЬШЕ ЧЕМ ЧЕРЕЗ ЧАС.', 23, 0],
    ['CAADAgADOQADsjRGHrDrs5Pilb50Ag', "ТЫ ЧОРНЫЙ НМЛСС. НАЖАЛУЙСЯ НА ПРОВЕРЯТОРОВ ЦИТРУСУ ИЛИ ДИПУ.", 23, 0],
    ['CAADAgADcwADE3yuAjwaEd_AmkdAAg', 'ТЫ ЧОРНЫЙ ФАЛЛИК СИМБОЛ. ПОСТАВЬ НА АВАТАРКУ ПОСЛЕДНЮЮ КАРТИНКУ В ТВОЕЙ ГАЛЕРЕЕ'
                                       ' И НОСИ ЕЁ ЦЕЛЫЕ СУТКИ.', 23, 0],
    ['CAADAgADSQADsjRGHk3DvMY4826-Ag', 'ТЫ ЧОРНЫЙ ЭЛЕКСОРИЕН. ОБРАЩАЙСЯ КО ВСЕМ ТАК, КАК БУДТО КАЖДЫЙ ПОМЕНЯЛ ПОЛ, '
                                       'ВКЛЮЧАЯ ТЕБЯ', 6, 0],
    ['CAADAgADQAADE3yuAqIdHAT-b_Z1Ag', 'ТЫ ЧОРНЫЙ АНДАРХ. ОБМАНЫВАЙ В КАЖДОМ СООБЩЕНИИ.', 6, 0],
    ['CAADAgAD_wADP_vRD5KLT6TsHgqzAg', 'ТЫ ЧОРНАЯ ТРИШШШ. НЕ СПИ ВСЮ НОЧЬ.', 23, 0],
    ['CAADAgADJgADE3yuAgzyFvLOhIa6Ag', 'ТЫ ЧОРНЫЙ РЕИНМАР. ЗАМЕНЯЙ ТОЛЬКО ПОЛОВИНУ СЛОВ В ПРЕДЛОЖЕНИЯХ '
                                       'НА ПРОТИВОПОЛОЖНЫЕ ПО СМЫСЛУ.', 6, 0],
    ['CAADAgADRgADE3yuAo6CDyklyziNAg', 'ТЫ ЧОРНАЯ ХЕЛЕНАК. ИЗ МОРЯ ДОЛЖНА ВЫЙТИ ТОЛЬКО ТЫ.', 23, 0],
    ['CAADAgADFAADE3yuAt6_zAhdfNIgAg', 'ТЫ ЧОРНАЯ ЛИИРА. ПОКАЗЫВАЙ ВСЕМ СЕКРЕТНЫЙ СТИКЕР, НО ТАК, ЧТОБЫ ТОТ, ПРО КОГО '
                                       'ЭТОТ СТИКЕР, НЕ ЗАМЕТИЛ.', 7, 0],
    ['CAADAgADkgADsjRGHiB0BqAbd2RpAg', 'ТЫ ЧОРНЫЙ ХАМПЕР. НАГОВОРИ УГРОЗ ЭРОТИЧНЫМ ГОЛОСОМ.', 23, 0],
    ['CAADAgADkwADsjRGHsxxCzJ8FO6CAg', 'ТЫ ЧОРНАЯ МОРСКАЯ ОСА. УКРАДИ СТОПРОЦЕНТНУЮ ВЕРОЯТНОСТЬ У КАКОГО-НИБУДЬ'
                                       ' ВЕЗУНЧИКА.', 23, 0],
    ['CAADAgADrwADsjRGHt6GosTv6QgJAg', "ТЫ ЧОРНЫЙ УНДО. ЗВОНИ ВСЕМ НОЧЬЮ СО СТРАШНОЙ АВАТАРКОЙ.", 23, 0],
    ['CAADAgADQwADE3yuAjanLHfb8yNTAg', "ТЫ ЧОРНАЯ ЧЕРНОСНЕЖКА. ПОДЛИЗЫВАЙСЯ КО ВСЕМ.", 6, 0],
    ['CAADAgADGgADE3yuArUzbFJSgDy9Ag', "ТЫ ЧОРНЫЙ ДЛИНОМОЗГ. ПИШИ УКРОКАПСОМ.", 6, 0],
    ['CAADAgADOgADE3yuAnigxGprtCJOAg', "ТЫ ЧОРНЫЙ ВЕЗУНЧИК. ПРИСТАВЬ ПИСТОЛЕТ К ЧАТУ И ПЯТЬ РАЗ ЭАЛОКНИ НА КУРОК. "
                                       "БАЯЗИД, ЕСЛИ ТЕБЯ ЗАБАНИЛО.", 23, 0],
    ['CAADAgADrgADsjRGHtWNyG_T4IzWAg', "ТЫ ЧОРНЫЙ АРУЛУТ. ПЕПЕИМЕНУЙСЯ В ПОСЛЕДНЕЕ СЛОВО, "
                                       "ПРИСЛАННОЕ В ЧАТ ПЕРЕД ВЗЯТИЕМ ТОБОЙ ЗАДАНИЯ, И ВЕДИ СЕБЯ КАК ОНО.", 23, 0],
    ['CAADAgADsAADsjRGHnlixd83VVd8Ag', "ТЫ ЧОРНЫЙ НОРМАЛЬ. ОБЩАЙСЯ ТОЛЬКО ЧУЖИМИ ФОРВАРДАМИ.", 6, 0],
    ['CAADAgADsQADsjRGHi_DJlHVbY9ZAg', "ТЫ ЧОРНЫЙ МЕДИА. ТЕБЕ НЕЛЬЗЯ ПРИСЫЛАТЬ МЕДИАФАЙЛЫ И СТИКЕРЫ, ОПИСЫВАЙ ИХ СЛОВАМИ.", 16, 0],
    ['CAADAgADTwADE3yuAipJeuii4UD_Ag', "ТЫ ЧОРНАЯ ТЕХХИ ТУОТЛИ. ОТВЕЧАЙ НА СООБЩЕНИЯ ЛИМЕРИКАМИ.", 6, 0]
]

anti_tasks = [
    "ТЕБЕ НЕЛЬЗЯ УДАЛЯТЬ ИЛИ РЕДАКТИРОВАТЬ СВОИ СООБЩЕНИЯ",
    "НАЙДИ КОГО-ТО, КТО СДЕЛАЕТ ЗАДАНИЕ ЗА ТЕБЯ",
    "АНТИКЛАЦ, ЕСЛИ НЕ СДЕЛАЕШЬ",
    "ВЫБЕРИ САМ СЕБЕ ДОПОЛНИТЕЛЬНОЕ ЗАДАНИЕ",
    "if not hasattr(player, 'ЗЯКА'):\n\ttask_complete = NULL",
    "СДЕЛАЙ ЗАДАНИЕ НАОБОРОТ"
]

ng_tasks = [
    'СФОТОГРАФИРУЙ СВОЁ ОТРАЖЕНИЕ В ЁЛОЧНОЙ ИГРУШКЕ!',
    'СЛОЖИ ИЗ МАНДАРИНОВЫХ ШКУРОК НЕПРИЛИЧНУЮ КАРТИНКУ И ПРИШЛИ В ЧАТ!',
    'СПОЙ ВСЛУХ ПЕСЕНКУ ПРО ЁЛОЧКУ И ПРИШЛИ В ЧАТ!',
    'ПЛЮХНИСЬ В СУГРОБ И СДЕЛАЙ СНЕЖНОГО АНГЕЛА!',
    'СМЕНИ АВАТАРКУ НА ПРАЗДНИЧНУЮ!',
    'СМЕНИ НИК НА ПРАЗДНИЧНЫЙ!',
    'СМЕНИ ПОЛ, РАСУ, ОРИЕНТАЦИЮ, РЕЛИГИЮ НА ПРАЗДНИЧНЫЕ!',
    'ВСТАНЬ НА ТУБАРЕТКУ И РАССКАЖИ ПРАЗДНИЧНЫЙ СТИШОК!',
    'ОБМОТАЙСЯ МИШУРОЙ И ГИРЛЯНДОЙ И СДЕЛАЙ СЕЛФИ!',
    'ПРИШЛИ ФОТО СВОЕЙ ЁЛОЧКИ!',
    'ОТНЫНЕ ТВОЯ ОБЯЗАННОСТЬ -- СООБЩАТЬ, СКОЛЬКО ДНЕЙ ОСТАЛОСЬ ДО НОВОГО ГОДА!']

love_tasks = [
             'НАПИШИ СВОЕЙ ПОЛОВИНКЕ РОМАНТИЧНОЕ СТИХОТВОРЕНИЕ',
             'ПРИГОТОВЬ СВОЕЙ ВТОРОЙ ПОЛОВИНКЕ РОМАНТИЧНОЕ БЛЮДО, ПРИШЛИ В ЧАТ ФОТО И РЕЦЕПТ',
             'СМАСТЕРИ ДЛЯ СВОЕЙ ПОЛОВИНКИ ВАЛЕНТИНКУ СВОИМИ РУКАМИ',
             'ЗАБРОСАЙ СВОЮ ПОЛОВИНКУ СЕРДЕЧКАМИ И ЛАЙКАМИ В СОЦСЕТЯХ',
             'ВОСХВАЛЯЙ СВОЮ ПОЛОВИНКУ В НИКЕ И НА АВАТАРКЕ',
             'КАЖДЫЕ ЧЕТЫРЕ ЧАСА ПРИЗНАВАЙСЯ В ЛЮБВИ КО СВОЕЙ ВТОРОЙ ПОЛОВИНКЕ, ПРИЧЁМ КАЖДЫЙ РАЗ ПО-РАЗНОМУ',
             'НАРИСУЙ СЕБЯ И СВОЮ ВТОРУЮ ПОЛОВИНКУ, ЧТОБЫ БЫЛО РОМАНТИЧНО',
             'ПОСВЯТИ СВОЕЙ ПОЛОВИНКЕ ЦЕЛЫЙ СТИКЕРПАК',
             'КИДАЙ СВОЕЙ ПОЛОВИНКЕ РОМАНТИЧНЫЕ ПЕСНИ О ЛЮБВИ'
             ]
end = ["есса", "ка", "иня", "ша", "ница", "уха"]
ends = ["ессы", "ки", "ини", "ши", "ницы", "ухи"]
exception_spisok = ["САРАСТИ", "БЛЕДИ"]
dura_stickers = [
                 'CAADAgAD7QIAAiSGFAUtKTE-L04-1AI', 'CAADAgADCwADdy_1D1mCkXkRI1k7Ag', 'CAADAgADCwADdy_1D1mCkXkRI1k7Ag',
                 'CAADAgADBQADdy_1D9bPrqqGz6gEAg', 'CAADAgADAwADdy_1D-Kg1Bf23dX9Ag', 'CAADAgADSQADdy_1D8XAPVA9EcicAg',
                 'CAADAgADJQADdy_1D5b97De4rtqvAg', 'CAADAgADKwADdy_1D-sUHzyCN7HjAg', 'CAADAgADHwIAAjHTyQEKhvAch1TwpgI',
                 'CAADBAADIgADxXu1FJiGrkhCvahzAg', 'CAADBAADGAADxXu1FGru43KA0KnOAg', 'CAADBAADGQADxXu1FNwTpZlPrZ_KAg',
                 'CAADBAADCQADxXu1FKslccT_TyS9Ag', 'CAADAgADSQADSuYQF5Gxq-tv51GSAg', 'CAADAgADXAADSuYQF63MQN8KbUIAAQI',
                 'CAADBAADAQADxXu1FHeu9P_RboVPAg', 'CAADAgADAQAD9MzXFZXcLLXw_wWOAg','CAADAgADZwADyJsDAAFgnzXc_Gjs5wI',
                 'CAADAgADFgAD8sL5DNx5jUEsMXbhAg', 'CAADBAADQgADMo1bAAHfTPvWobaLVQI', 'CAADAgADAwEAAj_70Q9GT3NHdO6VJQI',
                 'CAADBAADNwADMo1bAAGeQyzevdESDgI', 'CAADAgAD_gADP_vRD4cffIzA-wmVAg', 'CAADAgADLAADP_vRDycwOsunmkvsAg',
                 'CAADAgAD0QADP_vRD-nRmKAaQTThAg', 'CAADAgADzwADP_vRDyJkEWvq-7JyAg', 'CAADAgADHAADP_vRD-gwVB3OnCG9Ag',
                 'CAADAgADPAADP_vRD8FSbn5gssAhAg', 'CAADAgADkQADP_vRDxZpt9bjwPJTAg', 'CAADAgADOQADP_vRD2VXrcZmGbHdAg',
                 'CAADAgADKAUAApkvSwrcSz6ukhbpGAI', 'CAADAQADKwEAAqYkxgABwaXrOPlc6p4C', 'CAADAgADGgADsjRGHhGNZqIB9ZZXAg',
                 'CAADAgADGgAD8sL5DFBeR3coUN36Ag', 'CAADAgAD6QQAAmvEygorNBS6iya8ygI', 'CAADAgADIQkAAmrZzgcj7dBIVxrvZAI',
                 'CAADAgADxwgAAmrZzgfaE3eq1S3hCwI', 'CAADBAADPzEAAn5uJwNodKZDyHCLMAI', 'CAADAgADGAADbOefHk_5cKM8jNSnAg',
                 'CAADAgADFgUAAipVGAJAsLaMa-zIVQI', 'CAADAgADGgUAAipVGAIelxmcETXSKwI', 'CAADAgADCgAD5lxoAovSyg_Onm05Ag',
                 'CAADAgADfQADkQEtAAGq8kz1lYn43wI', 'CAADAgADWgADkostA1_y3iePGuUkAg', 'CAADBAADagADqHcSAAEok9Q-bdJR0QI',
                 'CAADBAADcgADqHcSAAEBP_hnYgYbDwI', 'CAADAgADXwcAAmOLRgzdiKskGG-bJgI', 'CAADAgADCgADP_vRD6FekfLRnTVOAg',
                 'CAADAgADqQADP_vRD724lx9VDnz4Ag', 'CAADAgADvAADP_vRD8mgbD1t03XNAg', 'CAADAgADvwADP_vRDz3shfLDkhwFAg',
                 'CAADAgADxQADP_vRD64C2EOzLqEtAg', 'CAADAgADyQADP_vRDx35c-ue_YihAg', 'CAADAgADzAADP_vRDy450ziAJjpBAg',
                 'CAADAgAD0gADP_vRD47pzGUaMPEbAg', 'CAADAgAD6AADP_vRD9RT1ood9Z-vAg', 'CAADAgAD1QADP_vRD8JzaZAGF5XCAg',
                 'CAADAgAD6wADP_vRD3k79M4YzHjCAg', 'CAADAgAD7gADP_vRD_C8P8x3DS6rAg', 'CAADAgADNwADqq5SBLghYAgqS2kIAg',
                 'CAADAgAD9AADP_vRD_EqrK6O5Dc_Ag', 'CAADAgAD8QADP_vRD9zOYccvBasaAg', 'CAADAgAD-wADP_vRD2tJlQxughhVAg',
                 'CAADAgADYwEAAhZ8aAOZHGE-jLPCQgI', 'CAADAgADFwEAAhZ8aANkT9oZzK6k8gI', 'CAADAgADJwEAAhZ8aANNQQfNKV5StAI',
                 'CAADAgADGQEAAhZ8aAOLsSzIekKUIgI', 'CAADAgADBwEAAhZ8aANVMD-_sgABuU4C', 'CAADAgADZQEAAhZ8aAMFnRaMsc6RRQI',
                 'CAADAgAD_wADFnxoAwbXtGNHGAyKAg', 'CAADAQADtQADJJtYBtXrVqAAAXG-OAI', 'CAADAQADygADJJtYBm11WntYmn6_Ag',
                 'CAADAgADQgADsjRGHgQoVN2SVvqHAg'
                 ]
dura_who = ['ДИП', 'ЦИТРУС', 'АРЕАТАНГЕНТ', 'ЧЕТЫРЕ', 'ЗЛОЙ АДМИН', 'НОРМАЛЬ',
            'ГОДВИЛЛЬ', 'ИИОО', 'БАГ', 'ЭЛЕКСОРИЕН', 'АНАЛЕПТИК', 'ПУШИСТЫЙ ТРИББЛ',
            'СИЛЬФУР', 'СУПЕР ТРУПЕР', 'ЭЛЛИОТ', 'ЛЕОНАРДО', 'ШЕНМАН', 'ШИЗИК', 'ЛИИРА',
            'О ЖИ', 'МИХЕЙ', 'НАШЁЛ НОЖНИЦЫ', 'ФИЛАШТЕКЬЮ', 'ХЕЛЕНАК', 'КАПЛЯ ЯНТАРЯ',
            'АЙСБРЕХЕР', 'ПОЛИНОМ ГАУССА', 'ФОБЕР', 'ДЛИНОМОЗГ', 'ВЕЗУНЧИК', 'ФАЛЛИК СИМБОЛ',
            'МАЛЕФИКА', 'АНДАРЧ', 'ДЖЕЙ ДЖИ', 'КАТИССА', 'МУХА-ХА', 'ВАЛИНОР', 'МЕДИА', 'ПАТРИСИЯ',
            'АЛФОРЧУ', 'НАРЕЗНОЙ', 'ТОТО РО', 'САРАСТИ', 'ЗОЛОТАНАНА', 'ХИРОПСАЛ',
            'ЮИ-ЛАЛЛИ', 'РЕЛЬС', 'ИСКУСАТЕЛЬНИЦА', 'НЕВЫРАЗИМОЕ НЕЧТО', 'ШИЛА', 'ЕВРОПОНТ',
            'ЦФР', 'АБИГЕЙЛ', 'УНДО', 'МАРИЯ К', 'РЕИНМАР', 'ЧЕРНОСНЕЖКА', 'НМЛСС', 'ПЛЕЯНА', 'АРУЛУТ',
            'РИННЕКО', 'МОРСКАЯ ОСА', 'УНХАЙЛИГ', 'ПОКРОВИТЕЛЬ БАРСИКОВ', 'ТРИШШШ', 'НЕ ТВОЯ МАЛЫШКА',
            'НЕВЫРАЗИМОЕ НЕЧТО', 'ТЕХХИ ТУОТЛИ', 'НОЧНАЯ ГАРПИЯ', 'РЫЦАРЬ ДОСТАВКИ',
            "ЧОРНАЯ ШИЛА", "ЧОРНАЯ ТОТОРО", "ЧОРНЫЙ АРЕАТАНГЕНТ", "ЧОРНЫЙ ЗЛОЙ АДМИН",
            "ЧОРНАЯ РИННЕКО", "ЧОРНЫЙ РЕЛЬС", "ЧОРНАЯ ЗОЛОТАНАНА", "ЧОРНЫЙ ИИОО",
            "ЧОРНЫЙ ПОЛИНОМ ГАУССА", "ЧОРНАЯ АБИГЕЙЛ", "ЧОРНЫЙ АЙСБРЕЙХЕР", "ЧОРНАЯ ИСКУСАТЕЛЬНИЦА",
            "ЧОРНАЯ МАРИЯ СЕРГЕЕВНА", "ЧОРНЫЙ РИТЕР", "ЧОРНАЯ ПАТРИСИЯ", "ЧОРНАЯ ВАЛИНОР", "ЧОРНЫЙ ФИЛАШТЕКЬЮ",
            "ЧОРНЫЙ ШЕНМАН", "ЧОРНЫЙ ЕВРОПОНТ", "ЧОРНЫЙ ШИЗИК", "ЧОРНЫЙ ДИП", "ЧОРНЫЙ СИЛЬФУР",
            "ЧОРНАЯ САРАСТИ", "ЧОРНЫЙ ФАЛЛИК СИМБОЛ", "ЧОРНЫЙ ЦИТРУС", "ЧОРНЫЙ ЭЛЕКСОРИЕН",
            "ЧОРНЫЙ ЭЛЛИОТ", "ЧОРНЫЙ НАРЕЗНОЙ", "ЧОРНЫЙ НМЛСС"
            ]
dura_do = ["ИСПОЛЬЗУЙ", "СПОЙ", "ОТПРАВЛЯЙ", "ПИШИ", "ЗАБАНЬ", "ЗАФЛУДИ", "ЭКОНОМЬ", "НЕ СДЕРЖИВАЙ", "СЛОМАЙ",
             "ПОМЕНЯЙ", "ПОСТАВЬ", "НАДЕНЬ", "ИСПОЛЬЗУЙ", "ВЫВЕДИ", "СПИЛИ", "ОТПРАВЬ", "НАРИСУЙ",
             "НАЙДИ", "ПОЙМАЙ", "ПОБЕДИ", "ИСПОЛЬЗУЙ", "ЗАПИРАТЬ", "ПИШИ", "ПРИДУМАЙ", "ПОПРОСИ", "ПОСЕЩАЙ", "СТАВЬ",
             "ПОЛУЧИ", "ПРЕДСКАЖИ", "ДОВЕДИ", "СПИЛИ", "ЗАКРОЙ", "ДОПИСЫВАЙ", "СДЕЛАЙ", "ПИШИ",
             "ПОМОГИ ПОЗНАТЬ", "УБЕЙ", "ПИШИ", "ПРИШЛИ", "ОТПРАВЬ", "УСТРОЙ", "ЗАКРОЙ", "ИГНОРИРУЙ",
             "ПРИВЕТСТВУЙ", "ПЕРЕРИСУЙ", "ЗАПУСТИ", "КАДРИ", "КАДРИ", "ОТПРАВЬ", "РАССКАЖИ", "НАПИШИ", "НАЗЫВАЙ",
             "ЗАМЕНЯЙ", "ДОБАВЛЯЙ", "СДЕЛАЙ", "ПИШИ", "НАДЕНЬ", "СООБЩАЙ", "РАССКАЖИ", "НАПИШИ",
             "ЛЯГ СПАТЬ НА", "НАЧИНАЙ", "СОСТАВЬ", "ОТВЕЧАЙ НА", "ОПИСЫВАЙ", "ДОСТАВЛЯЙ", "ПРОЧИТАЙ",
             "СОЗДАЙ", "СПОЙ", "НАХОДИ", "ПЕРЕРИСУЙ", "ПРИШЛИ", "ЗАДАЙ", "ЗВОНИ И ЖЕЛАЙ", "НАЗЫВАЙ", "ВЫПОЛНИ",
             "ОТПРАВЬ", "ПРИСЫЛАЙ", "ПИШИ", "ИСПОЛЬЗУЙ", "ПРОВЕРЬ", "РАССКАЖИ", "УДАЛЯЙ", "ПРОТЯНИ",
             "ИСПОЛЬЗУЙ", "ИСПРАВЛЯЙ", "ВВЕДИ", "ЗАКИДАЙ", "РАССКАЗЫВАЙ", "ОТВЕЧАЙ НА",
             "ПОЖАЛУЙСЯ НА", "ПОСТАВЬ", "СМЕНИ"
            ]
dura_what = ["ДИПЯНКУ", "ПЕСЕНКУ", "КАЖДУЮ КАРТИНКУ И СТИКЕР", "СКОБОЧКИ", "ОДНОЧАТОВЦА", "ЧАТ", "ВИРТУАЛЬНОЕ ПРОСТАНСТВО",
             "НЕНАВИСТЬ", "БОТА", "ПОЛ", "АНАЛИЗ", "ВСЁ", "МАСКУ", "НЕОБЫЧНЫЕ СИМВОЛЫ", "КОГО-НИБУДЬ", "ТРОИХ", "АУДИОСООБЩЕНИЕ",
             "ГАДОСТИ", "КАРТИНКУ", "ПОБЕЖДЁННОГО", "КАМЕНЬ", "УЯЗВИМОГО", "ТРАНСЛИТ", "КОГО-НИБУДЬ", "ВООБРАЖАЕМОГО ДРУГА",
             "ЗАДАЧКУ ПО МАТАНУ", "ПРОБЕЛ", "СТРОПРОЦЕНТНУЮ ВЕРОЯТНОСТЬ", "ПОСЛЕДНЮЮ КАРТИНКУ", "ПРОВАЛЕННОЕ ЗАДАНИЕ",
             "ЧАТ", "ОДНОЧАТОВЦА", "РОТ", "ПОСЛЕДНИЙ СЛОГ", "ИНТЕРЕСНУЮ ПОДЕЛКУ", "ВСЕ СЛОВА", "СИЛУ ЧТЕНИЯ",
             "СВОЁ ФОТО", "БАЯЗИДА", "МОЛОДЦА", "СТИКЕРШТОРМ", "ВКЛАДКУ", "ВСЕХ СОБЕСЕДНИКОВ", "КАЖДОГО", "АВАТАРКУ",
             "ИГРУ", "САМЦОВ", "САМОК", "ДЛИННОКОТА ИЗ 15 ФРАГМЕНТОВ", "ГРУСТНУЮ ИСТОРИЮ ПРО СЕБЯ", "УНДОГЛЮКИ", "ВСЕХ",
             "ВСЕ СЛОВА", "УМЕНЬШИТЕЛЬНО-ЛАСКАТЕЛЬНЫЕ СУФФИКСЫ", "ДОНОС", "АВУ И НИК", "ЯРЕНУ", "ЧТО ТЕБЕ ПРИСНИЛОСЬ",
             "ХОККУ", "ФРАЗЫ ИЗ ДНЕВНИКА", "КРОВАТЬ", "ВСЕ СВОИ СООБЩЕНИЯ", "ДОСЬЕ", "СООБЩЕНИЯ", "СВОИ ДЕЙСТВИЯ",
             "ВСЕ ПИСЬМА ОТ ДРУГИХ ИГРОКОВ", "КРАСИВОЕ СТИХОТВОРЕНИЕ", "АКТИВНЫЙ ЧАТ НА 10 ЧЕЛОВЕК", "МАТЕРНУЮ ПЕСЕНКУ",
             "ЛОГИЧЕСКИЕ ОШИБКИ ОППОНЕНТА", "АВАТАРКУ", "СВОЁ ФОТО", "ЗАДАЧКУ ПО МАТАНУ", "ДОБРОЕ УТРО",
             "ЗАДАНИЕ ДРУГОГО ИГРОКА", "АУДИОСООБЩЕНИЕ ДЛИТЕЛЬНОСТЬЮ ОКОЛО 40 СЕКУНД", "СТИКЕРЫ ТОЛЬКО ИЗ ОДНОГО ПАКА",
             "ВСЕ СВОИ СООБЩЕНИЯ НА БУМАГЕ", "ТОЛЬКО БУКВЫ", "ТОП ПОЗОРА",
             "ИСТОРИЮ", "ВСЕ СВОИ СООБЩЕНИЯ", "15 ШАГОВ", "АНТИТРАНСЛИТ",
             "ВСЕ ГРАММАТИЧЕСКИЕ ОШИБКИ", "ПРАВИЛО ДЛЯ ЧАТА", "ЯРЕНЩИКА", "ИСТОРИИ ИЗ ЧОРНОГО ЧАТА", "ПОДДЕЛКУ",
             "ВСЁ, ЧТО ТЕБЯ КАСАЕТСЯ,", "ПРОВЕРЯТОРОВ", "ПОСЛЕДНЮЮ КАРТИНКУ ИЗ ТВОЕЙ ГАЛЕРЕИ", "ПОЛ"
             ]
dura_how = ["15 СООБЩЕНИЙ",  "ВСЛУХ",  "ДИСТОРШН-БОТУ",  "ДВЕ МИНУТЫ",  "БАНХАММЕРОМ",  "БОЛЬШЕ ОСТАЛЬНЫХ",
            "БЗ ГЛСНХ",  "К СОГЛАСНЫМ",  "И ГОДВИЛЛЬ",  "И ПЕРЕИМЕНУЙСЯ",  "ПО АВАТАРКЕ",
            "С МАЛЕНЬКОЙ БУКВЫ",  "У ДРУГОГО ИГРОКА",  "В СООБЩЕНИЯХ",  "ЛОГ В СТУДИЮ",
            "В ПОДЗЕМЕ",  "ДЛИНОЙ МИНУТУ",  "А ПОТОМ УДАЛЯЙ",  "КРАСИВО",  "БУМАГОЙ",  "С ПОМОЩЬЮ САЧКА",
            "НОЖНИЦАМИ",  "В КАЖДОМ СООБЩЕНИИ",  "В МОРЕ",  "НАОБОРОТ",  "ПОСЛЕ ТАБЛЕТОК",  "У МИШИ",
            "В ТЕЧЕНИЕ 5 МИНУТ ПОСЛЕ УПОМИНАНИЯ",  "ПОСЛЕ КАЖДОЙ БУКВЫ",  "С ПОМОЩЬЮ ПУШКА",
            "СЕБЕ НА АВАТАРКУ", "В БУДУЩЕМ",  "ДО РУГАНИ И ИСТЕРИК",  "И НАПИШИ ПИТАФЬЮ",
            "ПОКА НЕ ЗАЧТУТ",  "К КАЖДОМУ СЛОВУ",  "СВОИМИ РУКАМИ",  "С ОШИБКАМИ И ОПЕЧАТКАМИ",
            "С ПОМОЩЬЮ КУЧИ СЛОВ",  "ХОТЯ БЫ НА ПАРУ МИНУТ",  "ГРАМОТНО",  "С АНИМЕШНЫМИ ГЛАЗАМИ",
            "ЕСЛИ ВИДИТ ДИП",  "ЕСЛИ ВИДИТ УХИ",  "ТОЛЬКО С ПОМОЩЬЮ СТИКЕРОВ",
            "И НЕ ЗАХОДИ В ГОДВИЛЛЬ ПОКА НЕ ЗАСЧИТАЮТ",  "И НЕ ОТВЕЧАЙ",
            "ТОМУ, КТО НАПИСАЛ ПЕРЕД ТОБОЙ",  "И ОСТАВАЙСЯ ЛИДЕРОМ",  "И ВЕДИ СЕБЯ КАК АЛЬФА-САМКА",
            "И ВЕДИ СЕБЯ КАК АЛЬФА-САМЕЦ",  "С ПЕРВОГО РАЗА",  "ЧТОБЫ ВСЕ ПЛАКАЛИ", "ПО ИМЕНИ",
            "МЕНЯЯ СМЫСЛ НА ПРОТИВОПОЛОЖНЫЙ",  "ВО ВСЕХ СЛОВАХ",  "И СДАЙ ТРЁХ ПРОИГРАВШИХ",  "НА БУКВУ П",
            "И МАНЕРУ ОБЩЕНИЯ ДРУГОГО ИГРОКА",  "ЗА НЕСКОЛЬКО МИНУТ ДО БОТА",
            "ЕСЛИ НИЧЕГО НЕ ПРИСНИЛОСЬ - БАЯЗИД",  "ОДИН ГЛАС - СТРОЧКА",  "ИСКЛЮЧИТЕЛЬНО",  "ВОВРЕМЯ",
            "КАК НЕ ГЕЙ",  "ВНИМАТЕЛЬНО", "ПРОСЛЕДИВ ЗА ИГРОКОМ",  "В РИФМУ",  "НЕ ОБЩАЯСЬ",  "АНОНИМНО",  "ВСЛУХ",
            "И УДАЛИ", "ВСЛУХ", "И НЕЗАМЕДЛИТЕЛЬНО НА ЭТО УКАЗЫВАЙ", "ТОМУ, КТО НАПИСАЛ ПЕРЕД ТОБОЙ, ЧТОБЫ БЫЛО ОБИДНО",
            "МИШЕ", "ВСЕМ", "ПО ОТЧЕСТВУ", "ОБЕСПЕЧИВ ПРОИГРЫШ ДРУГОМУ ИГРОКУ", "С КУЧЕЙ СЛОВ, ЧТОБЫ ВОЙСИ ВСЁ ПОНЯЛА",
            "И НИЧЕГО ДРУГОГО", "ФОТОГРАФИРУЙ И ПРИСЫЛАЙ", "С ЧЁТНЫМ НОМЕРОМ", "И ЗАСТАВЬ ВЗЯТЬ ЗАДАНИЕ",
            "В ЛИЧКЕ", "ТАК, ЧТОБЫ ДРУГИЕ ТЕБЯ НЕНАВИДЕЛИ", "И НЕ ЗАБЫВАЙ ПИСАТЬ ГАДОСТИ", "ПОКА НЕ ЭВАКУИРУЮТ",
            "В КАЖДОМ СООБЩЕНИИ", "ВНИМАТЕЛЬНО ЧИТАЯ ЧАТ", "И СЛЕДИ, ЧТОБЫ ВСЕ ВЫПОЛНЯЛИ", "МОЛНИЯМИ",
            "ПОСЛЕ ЧОРНЫХ ТАБЛЕТОК", "СВОИМИ РУКАМИ", "НО НЕ РАНЬШЕ, ЧЕМ ЧЕРЕЗ МИНУТУ", "ЦЫТРУСУ ИЛИ ДИПУ",
            "СЕБЕ НА АВАТАРКУ", "ВСЕМ", "ВЫРЕЗАВ ГЛАЗА"
            ]

pings = [
    ['', '! МЫ УЖЕ ЗАБЫЛИ КАК ТЫ ВЫГЛЯДИШЬ, ВЕДЬ ТЫ НЕ ПОЯВЛЯЛСЯ В ЧАТЕ ', '.'],
    ['МНЕ КАЖЕТСЯ, ТУТ КОГО-ТО НЕ ХВАТАЕТ. ', ', ТЕБЯ НЕ БЫЛО ', '. АУ!'],
    ['Я СКУЧАЮ, ', '! ТЫ ТАК КЛАССНО ДЕЛАЛ МОИ ЗАДАНИЯ ВСЕГО ', ' НАЗАД...'],
    ['', ', КАЖЕТСЯ, ТЫ ПРОПУСКАЕШЬ ЧТО-ТО ВАЖНОЕ. ', ' - ВСЁ ТАКИ ДОЛГИЙ СРОК.'],
    ['', ' ШАШЛЫК... ЗА ', ' ВРЕМЕНИ УЖЕ ДАВНО СГОРЕЛ!'],
    ['Я НЕ ЗНАЮ ЧТО ПИСАТЬ, ПОТОМУ ПРОСТО ПИНГАНУ ТЕБЯ, ', '. ПРОШЛО УЖЕ ', ' С ТВОЕГО ПРОШЛОГО ВИЗИТА.'],
    ['', ', ТЫ ХИЛ ИЛИ ДД? ЗА ', ' УЖЕ ДАВНО МОЖНО БЫЛО ОПРЕДЕЛИТЬСЯ'],
    ['ГЕТ ТАСК, ', '! ЧТО, ДУМАЛ НЕ ЗАМЕЧУ, ЧТО ТЕБЯ НЕТ УЖЕ ', '?'],
    ['ПОМОГИТЕ МНЕ ПИНГОВАТЬ ', ', А ТО Я САМ НЕ СПРАВЛЯЮСЬ. АЖ ', ' БЕЗ НАС ЖИВЁТ!'],
    ['', ', СНАЧАЛА ТЫ ПРОВОДИШЬ ', ' ВРЕМЕНИ БЕЗ ЧАТА, А ПОТОМ И В ГОДВИЛЛЬ ИГРАТЬ ПЕРЕСТАНЕШЬ?']
]

fuck_list = [
        'CAADAgADBgEAAnu13QoSNQMabLHvRQI', 'CAADAgADfQADSuYQF0Na2sxDYGZpAg', 'CAADAgADfAADSuYQF-lRxTqOpJTJAg',
        'CAADAgAD2AADRQt-Djm8BrmNUv9jAg', 'CAADAgADlQADeR3TB_Im_HDSpS97Ag', 'CAADAgADfAcAAlSlcgjkdMMPu9csLAI',
        'CAADBAADpgADFhjnE7rVP1fQ4k1EAg', 'CAADAgADDgAD9QAB8hVVLwJDNtD1ZAI', 'CAADAgADYwADkostA5e4UgiiGtiNAg',
        'CAADAgADZgADkostA4V0tCAWSjW_Ag', 'CAADAgADaAADkostA14Oj1YXIhAuAg', 'CAADAgADcgADkostA_0zTSUXrzGkAg',
        'CAADAgADSgAD-Aq8Al50paCcuOcVAg', 'CAADAgADVwAD4aRlBQ66H46naPqlAg', 'CAADAgAD0gEAAjwDWRXEF8DRoSG6zgI',
        'CAADAgADfQEAAjwDWRXJ5c_2lN2_SwI', 'CAADAgADpgMAAs7Y6AsBGW7oU-wJAwI', 'CAADAQAD-gADru5-BSTq6hwYOcqjAg',
        'CAADAgADggEAAonq5QfEW2_6yo1h0AI', 'CAADAgADHgUAAmvEygoUWHovvcjG4gI', 'CAADAgADfwMAAulVBRjxY2aaFwTyVwI',
        'CAADAgADFAEAAu7EoQoCbdLGMXpJkAI', 'CAADAgADnwADsjRGHk3E17jRmhkDAg', 'CAADAgADiAUAApb6EgUmJA3lDX-IQAI'
            ]

questions = [
    "А ЧТО СЛУЧИЛОСЬ-ТО?",
    'КТО СТАЛ ПЕРВЫМ ПИДОРОМ ДНЯ?',
    'КАК ЗОВУТ ТЁТУШКУ АКСОЛОТЛЯ?',
    'ЗАДАНИЕ РИТЕРА РАНЬШЕ БЫЛО ИЗВЕСТНО ПОД ДРУГИМ НИКОМ. КАКИМ ЖЕ?',
    'ОДНАЖДЫ ДИП ПРОСПОРИЛ ЦЫТРУСУ ЛИМЕРИК. О ЧЁМ БЫЛ СПОР?',
    'КАК В МУМЫРЯХ ПОЯВИЛОСЬ СОЛНЦЕСТОЯНИЕ?',
    'ЧТО БЫЛО РАНЬШЕ, БОТ ИЛИ ЗАДАНИЯ?',
    'ЧТО СКРЫВАЕТСЯ ЗА ТОПОМ САРАСТИ?',
    'ИЗ-ЗА КОГО ПОЯВИЛИСЬ РАЗНЫЕ ВАРИАНТЫ МОЛОДЦЕВАНИЯ?',
    'КАКАЯ ФИЧА ТАК И НЕ ЗАРАБОТАЛА, ХОТЯ СУЩЕСТВУЕТ БОЛЬШЕ ГОДА?',
    'ЧТО ЕЩЁ ЕСТЬ В ДОМИКЕ ЗЕЛЁНОГО АКСОЛОТЛЯ?',
    'КАКОМУ ШИЗИКУ ПРИНАДЛЕЖИТ ЗНАМЕНИТЫЕ ФРАЗЫ "РАКОНЫ ТАКИЕ ГАДКИЕ" И "ПЕРЛОВКА ОТВРАТИТЕЛЬНА"?',
    "ЕСЛИ ПРИСМОТРЕТЬСЯ К СЕРДЕЧКУ НА ПАЛОЧКЕ, МОЖНО ЗАМЕТИТЬ АКСОЛОТЛЯ В ТЕЛЬНЯШКЕ. ЧТО ОН ДЕЛАЕТ?",
    "КАКОЕ НОВОГОДНЕЕ ЗАДАНИЕ ДОСТАЛОСЬ ЭТР И ЧТО ОНА СДЕЛАЛА?"
            ]

answers = [
    "АКСОЛОТЛЬ СТАЛ ТАКИМ, КАК ГОД НАЗАД",
    'ИСКУСАТЕЛЬНИЦА',
    'САШЕНЬКА',
    'ЮИ-ЛАЛЛИ',
    'ДОГАДАЕТСЯ ЛИ КТО-НИБУДЬ, ЧТО ИХ НИКИ -- ЭТО НОВЫЕ КОМАНДЫ АКСОЛОТЛЯ',
    'В ПРОЦЕССЕ ИГРЫ В КВИЗ',
    'ТОЛЬКО НУБЫ СЧИТАЮТ, ЧТО БОТ',
    'ПУСИЧКА',
    'ШЬЮЗЕН',
    'ПРИВЕТСТВИЕ НОВЫХ МЕМБЕРОВ',
    "ДУРНИР",
    "РЕЛЬС",
    "ОТКРЫВАЕТ ГЛАЗОМ ПИВНУЮ БУТЫЛКУ",
    "ПРИГОТОВИТЬ НЕОБЫЧНЫЙ САЛАТ. ЭТР ЕГО ПРИГОТОВИЛА И СЪЕЛА"
]

grammar_nazi_explanation = [
    ['ТЫ СОВЕРШИЛ ОШИБКУ В СЛОВЕ "', '", БОЛЬШЕ ТАК НЕ ДЕЛАЙ.'],
    ['ЧТО ЗА ЖАЛКАЯ ПАРОДИЯ НА СЛОВО "', '"?'],
    ['ТОЛЬКО НУБЫ ПИШУТ СЛОВО "', '" С ОШИБКАМИ, НЕ УПОДОБЛЯЙСЯ ИМ.'],
    ['МНЕ НЕ НРАВИТСЯ, КОГДА СЛОВО "', '" ТАК КОВЕРКАЮТ. Я БУДУ ВЫНУЖДЕН ПРИНЯТЬ МЕРЫ, ЕСЛИ ЭТО НЕ РЕКРАТИТСЯ.'],
    ['ГРАМОТНЫЕ ДЕВОЧКИ И МАЛЬЧИКИ ПИШУТ "', '".'],
    ['И ВСЁ-ТАКИ "', '"!']
                           ]